announcements/forms-old-is-gold.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-06-03 Wed 08:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Viewing Data Records As Forms: Old Is Gold!</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="T.V Raman" />
</head>
<body>
<div id="content">
<h1 class="title">Viewing Data Records As Forms: Old Is Gold!</h1>
<div id="outline-container-orgf03381d" class="outline-2">
<h2 id="orgf03381d"><span class="section-number-2">1</span> Executive Summary</h2>
<div class="outline-text-2" id="text-1">
<p>
Given a file containing data records made up of multiple fields, you
can easily view them using Emacs' <code>forms</code> library.
</p>
</div>
</div>

<div id="outline-container-org25f0d41" class="outline-2">
<h2 id="org25f0d41"><span class="section-number-2">2</span> Background: BBC Program Listings</h2>
<div class="outline-text-2" id="text-2">
<p>
I use Perl utility <code>get_player</code> to fetch details of BBC Radio
programs. When I was using this frequently, I had installed package
<code>iplayer.el</code> from Melpa &#x2014; that package presented the data as   a 
nicely organized  Org document. Time passed,  and I somehow stopped
using it, until &#x2026; last week. Then I discovered that package
<code>iplayer</code> on Melpa hadn't been updated in a few years, and worse had
broken because package <code>org</code> no longer includes now obsoleted
sub-module <code>orgstruct</code>.
</p>
</div>
</div>


<div id="outline-container-org04dd571" class="outline-2">
<h2 id="org04dd571"><span class="section-number-2">3</span> Task: Viewing BBC Program Listings</h2>
<div class="outline-text-2" id="text-3">
<p>
When I realized package <code>iplayer</code> was broken, I tried to make up for
its loss for a few days by using shell-level utilities like <code>cut</code>. But
then I missed the convenience of being able to work with the data with
all of Emacs' power and was initially tempted to write a new package
&#x2014; after all, how hard is it to take a record, split it into fields
and display it in a desired form? Fortunately, I remembered another of
my favorite edicts from the creator of Perl (Larry Wall) 
</p>
<pre class="example">
Lazy Programmer Is A Good Programmer
</pre>


<p>
At the same time I had a strong sense of dejavu &#x2014; in the early daysa
of Emacspeak (approx 1995), I remembered demonstrating the power of
Emacs to manipulate and display data records by using  file
<span class="underline">/etc/passwd</span> as an example.
</p>
</div>
</div>

<div id="outline-container-org5413461" class="outline-2">
<h2 id="org5413461"><span class="section-number-2">4</span> The Free Solution</h2>
<div class="outline-text-2" id="text-4">
<p>
So the completely free (AKA zero-work) solution I used was to leverage
Emacs' built-in <code>forms</code> library &#x2014; the solution
as created  
in
<a href="https://github.com/tvraman/emacspeak/blob/master/etc/forms/get-iplayer.el#L3">get-iplayer.el</a> is below:
</p>



<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">setq</span> forms-read-only t)
(<span style="color: #a020f0;">setq</span> forms-file (expand-file-name <span style="color: #8b2252;">"~/.get_iplayer/radio.cache"</span>))
(<span style="color: #a020f0;">setq</span> forms-number-of-fields 16)
(<span style="color: #a020f0;">setq</span> forms-field-sep <span style="color: #8b2252;">"|"</span>)
(<span style="color: #a020f0;">setq</span> forms-format-list
      (list
       <span style="color: #8b2252;">"Id: "</span>  1 <span style="color: #8b2252;">"\t"</span> <span style="color: #8b2252;">"Name: "</span> 3 <span style="color: #8b2252;">"\n"</span>
       <span style="color: #8b2252;">"Episode: "</span> 4 <span style="color: #8b2252;">"\t"</span> <span style="color: #8b2252;">"Description: "</span>  12 <span style="color: #8b2252;">"\n"</span>))
</pre>
</div>


<p>
With the above in place, you can:
</p>

<ol class="org-ol">
<li>M-x forms-find-file RET get-iplayer.el</li>
<li>This  displays one record at  a time as specified by <code>forms-format-list</code>.</li>
<li>You can  search through records etc.</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2020-06-03 Wed 00:00</p>
<p class="author">Author: T.V Raman</p>
<p class="date">Created: 2020-06-03 Wed 08:00</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
